{
    "extraction_rules": [
        "1. Preserve all company names, product names, and branded terms (e.g., 'Ernst & Young', 'EY', 'EYMP').",
        "2. Keep all legal entity types in their original form (e.g., 'LLC', 'GmbH', 'S.A.').",
        "3. Maintain all tax-related terms and codes in their original language (e.g., 'W-2', '1040', 'P45').",
        "4. Do not translate specific visa types or immigration statuses (e.g., 'H-1B', 'Tier 2', 'Blue Card').",
        "5. Preserve all currency codes and financial abbreviations (e.g., 'USD', 'EUR', 'EBITDA').",
        "6. Keep human resource-specific acronyms untranslated (e.g., 'HRIS', 'PTO', 'KPI').",
        "7. Maintain all job titles and position names in their original form.",
        "8. Do not translate names of government agencies or regulatory bodies.",
        "9. Preserve all country-specific social security or tax identification numbers.",
        "10. Keep all proper nouns, including names of people, places, and organizations.",
        "11. Maintain industry-specific terminology related to global mobility (e.g., 'expatriate', 'repatriation', 'host country').",
        "12. Do not translate specific benefit plan names or codes.",
        "13. Preserve all legal document names in their original language (e.g., 'Power of Attorney', 'Affidavit').",
        "14. Keep all acronyms related to international trade and commerce (e.g., 'INCOTERMS', 'FOB').",
        "15. Maintain technical terms related to payroll and compensation (e.g., 'gross-up', 'tax equalization').",
        "16. Do not translate specific names of tax treaties or international agreements.",
        "17. Preserve all references to specific sections of tax codes or legal statutes.",
        "18. Keep all measurement units in their original form (e.g., 'miles', 'kilograms').",
        "19. Maintain all version numbers, serial numbers, and unique identifiers.",
        "20. Do not translate names of specific software systems or modules used in EYMP.",
        "21. For HTML content, extract text from each element separately while preserving tags in metadata.",
        "22. For JSON content, extract translatable strings from key-value pairs while maintaining the structure.",
        "23. For XML content, extract text from each element and attribute separately, preserving tags in metadata.",
        "24. Keep all numbers, dates, and time formats unchanged.",
        "25. Preserve all URLs, email addresses, and file paths.",
        "26. Maintain formatting such as bold, italic, or underline in the metadata.",
        "27. For list items, preserve the list structure and extract each item separately.",
        "28. Identify and mark domain-specific terms or technical jargon as non-translatable.",
        "29. Do not translate mathematical formulas or equations.",
        "30. Preserve any placeholders or variables in the original text (e.g., '{username}', '[username]' '%s')."
    ]
}